# Removing Duplicates

There are approches
- by using iteration and condition
- by converting object into dict keys
- by converting it to set

1. by using iteration and condition

In [ ]:
xList =[1,23,55,66,77,23,55,66,98,12,1,'hello','world','hello']
xList

In [ ]:
x=[1,2,3,5,3,4,2,1,7,6,5,8,9]
res = [] 
for i in x: 
    if i not in res: 
        res.append(i) 
print(res)

In [ ]:
x=[1,2,3,5,3,4,2,1,7,6,5,8,9]
res = [] 
[res.append(i) for i in x if i not in res] 
print(str(res))

2. by converting object into dict keys

In [ ]:
mydist ={'key':'value'}
mylist = ["a", "b", "a", "c", "c"]
mylist = list(dict.fromkeys(mylist))
print(mylist)

In [ ]:
def removeDup(x):
    return list(dict.fromkeys(x))

mylist = removeDup(["a", "b", "a", "c", "c"])

print(mylist)

3. by converting it to set

In [ ]:
x=[1,2,3,5,3,4,2,1,7,6,5,8,9]
x= list(set(x)) 
print(x)

# Creating a data map and data plan

 A data map is an overview of the dataset. You use it to spot potential problems in your data, such as
 - Redundant variables
 - Possible errors
 - Missing values
 - Variable transformations

Checking for these problems goes into a data plan, which is a list of tasks you have to perform to ensure the integrity of your data

In [1]:
import pandas as pd

In [ ]:
#create a dataframe using dictionary
df = pd.DataFrame({'A': [10,20,30,40,50,1,1],
 'B': [1,2,3,5,4,2,5],
                  } )
df

In [ ]:
df.describe()

In [ ]:
#create a dataframe using dictionary
df = pd.DataFrame({'A': [0,0,0,0,0,1,1],
 'B': [1,2,3,5,4,2,5],
 'C': [5,3,4,1,1,2,3]})
df

In [ ]:
#create a df groubby A 
a_group_desc = df.groupby('A').describe()
a_group_desc

In [ ]:
#another way to see the result
unstacked = a_group_desc.unstack()
unstacked

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,30.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
df

sum

In [ ]:
#find the sum
df.sum()

Mean

In [ ]:
#find the mean
df.mean()

Standard deviation

In [ ]:
df.std()

Count

In [ ]:
df.count()

Median

In [ ]:
df.median()

Mode

In [ ]:
df.mode()

Minimum value record

In [ ]:
df.min()

Maximum value record

In [ ]:
df.max()

Product

In [ ]:
df.prod()

Cummutative Sum

In [ ]:
df.cumsum()

Describe Function

In [ ]:
df.describe()

In [ ]:
df=pd.read_csv("Cricket_DS - Sheet1.csv")
df

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.describe()

# Manipulating Categorical Variables

 A categorical variable is one that has a specific value from a limited selection of values. The number of values is usually fixed
 - Categorical()
 - cat.categories
 - cat.codes

## Creating categorical variables

In [2]:
car_colors = pd.Series(['Blue', 'Red', 'Green'],dtype='category')

In [3]:
car_colors

0     Blue
1      Red
2    Green
dtype: category
Categories (3, object): [Blue, Green, Red]

Example 1

In [4]:
# using categorical function
pd.Categorical([1, 2, 3, 1, 2, 3])

[1, 2, 3, 1, 2, 3]
Categories (3, int64): [1, 2, 3]

Example 2

In [5]:
pd.Categorical(['a', 'b', 'c', 'a', 'b', 'c'])

[a, b, c, a, b, c]
Categories (3, object): [a, b, c]

Example 3

In [6]:
pd.Categorical?

In [7]:
c = pd.Categorical(['a','b','c','a','b','c'], ordered=True,categories=['c', 'b', 'a'])

In [8]:
c

[a, b, c, a, b, c]
Categories (3, object): [c < b < a]

In [9]:
c.min()

'c'

In [10]:
c.max()

'a'

Example 4

In [11]:
studentRec1=pd.Series({'Name':'TRisha','Gender':'Female','City':'Anand','cpi':8})
studentRec2=pd.Series({'Name':'Krisha','Gender':'Female','City':'Vadodara','cpi':8.5})
studentRec3=pd.Series({'Name':'krish','Gender':'Male','City':'Anand','cpi':9})

In [12]:
df2=pd.DataFrame([studentRec1,studentRec2,studentRec3])
df2

     Name  Gender      City  cpi
0  TRisha  Female     Anand  8.0
1  Krisha  Female  Vadodara  8.5
2   krish    Male     Anand  9.0

In [15]:
df2.Gender=pd.Categorical(df2.Gender,['Female','Male'])
df2
df2.Gender

0    Female
1    Female
2      Male
Name: Gender, dtype: category
Categories (2, object): [Female, Male]

In [16]:
df2.Gender.cat.categories

Index(['Female', 'Male'], dtype='object')

In [27]:
df2

     Name  Gender      City  cpi
0  TRisha  Female     Anand  8.0
1  Krisha  Female  Vadodara  8.5
2   krish    Male     Anand  9.0

In [28]:
df2.Gender=df2.Gender.cat.codes

In [29]:
df2

     Name  Gender      City  cpi
0  TRisha       0     Anand  8.0
1  Krisha       0  Vadodara  8.5
2   krish       1     Anand  9.0

In [26]:
df2.Gender

0    Female
1    Female
2      Male
Name: Gender, dtype: category
Categories (2, object): [Female, Male]

In [18]:
pd.get_dummies(df2.Gender)

   Female  Male
0       1     0
1       1     0
2       0     1

Example 5

In [19]:
emp1=pd.Series({'Name':'TRisha','Gender':'Female','designation':'Programmer','Sal':30000})
emp2=pd.Series({'Name':'Rudra','Gender':'Male','designation':'Senior Programmer','Sal':50000})
emp3=pd.Series({'Name':'Ayan','Gender':'Male','designation':'Team Lead','Sal':55000})
emp4=pd.Series({'Name':'Krishna','Gender':'Female','designation':'Project Manager','Sal':100000})
ProjectTeam=pd.DataFrame([emp1,emp2,emp3,emp4])
ProjectTeam

      Name  Gender        designation     Sal
0   TRisha  Female         Programmer   30000
1    Rudra    Male  Senior Programmer   50000
2     Ayan    Male          Team Lead   55000
3  Krishna  Female    Project Manager  100000

In [20]:
ProjectTeam.designation=pd.Categorical(['Programmer', 'Senior Programmer','Team Lead','Project Manager'],ordered = True, categories=['Programmer', 'Senior Programmer','Team Lead','Project Manager'])

In [21]:
ProjectTeam.designation

0           Programmer
1    Senior Programmer
2            Team Lead
3      Project Manager
Name: designation, dtype: category
Categories (4, object): [Programmer < Senior Programmer < Team Lead < Project Manager]

In [22]:
ProjectTeam

      Name  Gender        designation     Sal
0   TRisha  Female         Programmer   30000
1    Rudra    Male  Senior Programmer   50000
2     Ayan    Male          Team Lead   55000
3  Krishna  Female    Project Manager  100000

In [23]:
ProjectTeam.designation = ProjectTeam.designation.cat.codes

In [24]:
ProjectTeam

      Name  Gender  designation     Sal
0   TRisha  Female            0   30000
1    Rudra    Male            1   50000
2     Ayan    Male            2   55000
3  Krishna  Female            3  100000

## Renaming levels

 cat.categories

In [30]:
car_colors = pd.Series(['Blue', 'Red', 'Green'],
 dtype='category')
car_colors

0     Blue
1      Red
2    Green
dtype: category
Categories (3, object): [Blue, Green, Red]

In [32]:
car_data = pd.Series(
 pd.Categorical(
 ['Blue', 'Green', 'Red', 'Blue', 'Red'], categories=car_colors, ordered=False))

In [33]:
car_data

0     Blue
1    Green
2      Red
3     Blue
4      Red
dtype: category
Categories (3, object): [Blue, Green, Red]

In [34]:
car_colors.cat.categories = ["Purple", "Yellow", "Mauve"]
car_data.cat.categories = car_colors

In [35]:
car_data

0    Purple
1    Yellow
2     Mauve
3    Purple
4     Mauve
dtype: category
Categories (3, object): [Purple, Yellow, Mauve]

In [36]:
car_colors

0    Purple
1     Mauve
2    Yellow
dtype: category
Categories (3, object): [Purple, Yellow, Mauve]

## Combining levels

In [49]:
car_colors = pd.Series(['Blue', 'Red', 'Green'],
 dtype='category')

In [62]:
car_data = pd.Series(
 pd.Categorical(
 ['Blue', 'Green', 'Red', 'Green', 'Red', 'Green','Green', 'Red', 'Green','Green', 'Blue', 'Green'],
 categories=car_colors, ordered=False))

In [63]:
car_data.cat.categories = ["Blue_Red", "Green", "Red"]

In [64]:
car_data

0     Blue_Red
1        Green
2          Red
3        Green
4          Red
5        Green
6        Green
7          Red
8        Green
9        Green
10    Blue_Red
11       Green
dtype: category
Categories (3, object): [Blue_Red, Green, Red]

In [65]:
car_data

0     Blue_Red
1        Green
2          Red
3        Green
4          Red
5        Green
6        Green
7          Red
8        Green
9        Green
10    Blue_Red
11       Green
dtype: category
Categories (3, object): [Blue_Red, Green, Red]

In [66]:
car_data.isin(['Red'])

0     False
1     False
2      True
3     False
4      True
5     False
6     False
7      True
8     False
9     False
10    False
11    False
dtype: bool

In [67]:
car_data.loc[car_data.isin(['Red'])] = 'Blue_Red'

In [68]:
car_data

0     Blue_Red
1        Green
2     Blue_Red
3        Green
4     Blue_Red
5        Green
6        Green
7     Blue_Red
8        Green
9        Green
10    Blue_Red
11       Green
dtype: category
Categories (3, object): [Blue_Red, Green, Red]

## Finding the missing data

In [69]:
import numpy as np

In [70]:
s = pd.Series([1, 2, 3, np.NaN, 5, 6, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
6    NaN
dtype: float64

In [71]:
np.nan == None

False

In [72]:
np.nan == np.nan

False

In [73]:
np.isnan(np.nan)

True

In [74]:
print(s.isnull())

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [75]:
s.isna()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [76]:
s[s.isna()]

3   NaN
6   NaN
dtype: float64

In [78]:
s = pd.Series(["a", "b", np.nan, "a"], dtype="category")
s

0      a
1      b
2    NaN
3      a
dtype: category
Categories (2, object): [a, b]

In [79]:
s.cat.codes

0    0
1    1
2   -1
3    0
dtype: int8

In [80]:
df=pd.read_csv('studentRecord.csv')

In [81]:
df

      name   id  sem1_SPI  sem2_SPI  sem3_SPI      City   State
0    Ankit  1.0       8.0       8.5       9.0  Vadodara  Gujrat
1   Shreya  2.0       NaN       9.0       8.8     Anand  Gujrat
2   Akshay  3.0       6.0       5.0       7.0       NaN     NaN
3     Riya  NaN       NaN       5.0     -99.0  Vadodara     NaN
4  Roshani  4.0       7.0       NaN       NaN     Anand  Gujrat
5    Navya  NaN       8.0       NaN       NaN  Vadodara     NaN

In [82]:
df.isna()

    name     id  sem1_SPI  sem2_SPI  sem3_SPI   City  State
0  False  False     False     False     False  False  False
1  False  False      True     False     False  False  False
2  False  False     False     False     False   True   True
3  False   True      True     False     False  False   True
4  False  False     False      True      True  False  False
5  False   True     False      True      True  False   True

In [83]:
df.isnull()

    name     id  sem1_SPI  sem2_SPI  sem3_SPI   City  State
0  False  False     False     False     False  False  False
1  False  False      True     False     False  False  False
2  False  False     False     False     False   True   True
3  False   True      True     False     False  False   True
4  False  False     False      True      True  False  False
5  False   True     False      True      True  False   True

## Encoding missingness

isna(), fillna(), dropna()

In [102]:
s.fillna?

In [89]:
s = pd.Series([1, 2, 3, np.NaN, 5, 6, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
6    NaN
dtype: float64

Way 1: Fill the missing data with zero

In [85]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    5.0
5    6.0
6    0.0
dtype: float64


Way 2: Fill the missing data with mean

In [90]:
s.mean()

3.4

In [91]:
s.fillna(int(s.mean()))

0    1.0
1    2.0
2    3.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

Way 3: Fill the missing data with the previous record/data/value

In [92]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    5.0
5    6.0
6    6.0
dtype: float64

Way 4: Fill the missing data with the upcoming/next value in df

In [93]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    5.0
4    5.0
5    6.0
6    NaN
dtype: float64

In [94]:
s.fillna(method='backfill')

0    1.0
1    2.0
2    3.0
3    5.0
4    5.0
5    6.0
6    NaN
dtype: float64

In [95]:
s.fillna(method='pad')

0    1.0
1    2.0
2    3.0
3    3.0
4    5.0
5    6.0
6    6.0
dtype: float64

In [96]:
s = pd.Series([1, 2, 3, np.NaN, 5, 6, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
6    NaN
dtype: float64

In [97]:
s.dropna()

0    1.0
1    2.0
2    3.0
4    5.0
5    6.0
dtype: float64


Another Example

In [129]:
df = pd.read_csv("studentRecord.csv")
df

      name   id  sem1_SPI  sem2_SPI  sem3_SPI      City   State
0    Ankit  1.0       8.0       8.5       9.0  Vadodara  Gujrat
1   Shreya  2.0       NaN       9.0       8.8     Anand  Gujrat
2   Akshay  3.0       6.0       5.0       7.0       NaN     NaN
3     Riya  NaN       NaN       5.0     -99.0  Vadodara     NaN
4  Roshani  4.0       7.0       NaN       NaN     Anand  Gujrat
5    Navya  NaN       8.0       NaN       NaN  Vadodara     NaN

In [109]:
df['City'].isna()

0    False
1    False
2     True
3    False
4    False
5    False
Name: City, dtype: bool

In [110]:
df['City'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
Name: City, dtype: bool

In [111]:
df['State'].isna()

0    False
1    False
2     True
3     True
4    False
5     True
Name: State, dtype: bool

In [130]:
new_df = df.fillna({'id':0,
                     'City':'Not Metioned',
                     'State':'Gujarat'}
                   )
new_df

      name   id  sem1_SPI  sem2_SPI  sem3_SPI          City    State
0    Ankit  1.0       8.0       8.5       9.0      Vadodara   Gujrat
1   Shreya  2.0       NaN       9.0       8.8         Anand   Gujrat
2   Akshay  3.0       6.0       5.0       7.0  Not Metioned  Gujarat
3     Riya  0.0       NaN       5.0     -99.0      Vadodara  Gujarat
4  Roshani  4.0       7.0       NaN       NaN         Anand   Gujrat
5    Navya  0.0       8.0       NaN       NaN      Vadodara  Gujarat

In [131]:
new_df['sem2_SPI'].isnull()

0    False
1    False
2    False
3    False
4     True
5     True
Name: sem2_SPI, dtype: bool

In [132]:
new_df['sem2_SPI']=new_df['sem2_SPI'].fillna(method='ffill')

In [133]:
new_df

      name   id  sem1_SPI  sem2_SPI  sem3_SPI          City    State
0    Ankit  1.0       8.0       8.5       9.0      Vadodara   Gujrat
1   Shreya  2.0       NaN       9.0       8.8         Anand   Gujrat
2   Akshay  3.0       6.0       5.0       7.0  Not Metioned  Gujarat
3     Riya  0.0       NaN       5.0     -99.0      Vadodara  Gujarat
4  Roshani  4.0       7.0       5.0       NaN         Anand   Gujrat
5    Navya  0.0       8.0       5.0       NaN      Vadodara  Gujarat

## References

- Python for data science for dummies by  John Paul Mueller,Luca Massaron